# Introduccion a manejo de datos con Pandas

**Pandas** es una librería de manipulación de datos. Es probablemente una de las más extendidas en el campo. 
Se recomienda revisar la página oficial para acceder a la documentación de funcionamiento.
Incluye funciones para la visualización exploratoria de los datos que emplearemos en estos ejercicios.

- Página oficial de documentación: https://pandas.pydata.org/pandas-docs/stable/index.html
- En "10 minutes to pandas" realiza un resumen rápido de las características más importantes (en la asignatura sólo veremos unas pocas): https://pandas.pydata.org/pandas-docs/stable/10min.html

A continuación se muestran ejemplos de las funcionalidades que más se puede necesitar encontrar. Los ejemplos se basan en el tutorial de "10 minutes to pandas".

Adicionalmente, se emplea en algunos apartados la librería **Numpy** (para computación matemática). No se emplea de forma exhaustiva, pero de ser necesario, se puede encontrar la referencia de la misma aquí: https://docs.scipy.org/doc/numpy/reference/

En todos los casos, lo primero que se hace en el script es importar las librerías que se van a emplear:

In [1]:
import pandas as pd #Librería para el manejo de datos en Python. Permite realizar visualizaciones sencillas.
import numpy as np #Librería para computación numérica en Python.

## Crear Objetos de Datos

En pandas emplearemos en estos ejercicios principalmente 2 tipos de estructuras:
 - Series: Son arrays unidimensionales con indexación (arrays con índice o etiquetados), similares a los [diccionarios](https://docs.python.org/2/tutorial/datastructures.html#dictionaries). Pueden generarse a partir de diccionarios o de [listas](https://docs.python.org/2/tutorial/datastructures.html#more-on-lists).
 - DataFrame: Son estructuras de datos similares a las tablas de bases de datos relacionales como SQL. 
 Los DataFrame contienen siempre un índice (que identifica cada entrada / fila) y generalmente varias columnas (identifican cada dato en la(s) entrada(s)). El índice será siempre de tipo 'Serie'. 
 Pueden emplearse índices temporales (timestamps) o índices numéricos.
 
 Una introducción a este tipo de estructuras se recoge aquí: https://pandas.pydata.org/pandas-docs/stable/dsintro.html

In [2]:
# Generacion de una Serie numérica
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# Generacion de una Serie temporal
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
# Generacion de un DataFrame que emplea la serie temporal como índice
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.164156  0.690580  0.074791 -0.619303
2013-01-02  1.756228  1.084116 -0.710002 -0.094943
2013-01-03  0.059389  0.212852  0.195152  1.548024
2013-01-04 -1.808922  0.894554 -1.115373  1.094575
2013-01-05  0.766672 -0.217860 -0.022103  0.213908
2013-01-06  0.861545 -0.938988 -0.728369 -0.395172

## Mostrar datos

In [5]:
# 2 primeros elementos (segun el indice)
df.head(2)

                   A         B         C         D
2013-01-01 -1.164156  0.690580  0.074791 -0.619303
2013-01-02  1.756228  1.084116 -0.710002 -0.094943

In [6]:
# 2 ultimos elementos (segun el indice)
df.tail(2)

                   A         B         C         D
2013-01-05  0.766672 -0.217860 -0.022103  0.213908
2013-01-06  0.861545 -0.938988 -0.728369 -0.395172

In [7]:
# Acceder al índice
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
# Acceder a los valores
df.values

array([[-1.16415631,  0.6905803 ,  0.07479067, -0.61930261],
       [ 1.75622773,  1.08411618, -0.71000172, -0.09494269],
       [ 0.05938929,  0.21285177,  0.19515237,  1.54802405],
       [-1.80892236,  0.89455446, -1.11537307,  1.09457465],
       [ 0.76667204, -0.21785968, -0.02210322,  0.21390826],
       [ 0.86154543, -0.93898828, -0.728369  , -0.39517229]])

In [9]:
#  Acceder a las columnas
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [10]:
# Breve descripción de la tabla
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.078459  0.287542 -0.384317  0.291182
std    1.342269  0.765614  0.536031  0.857930
min   -1.808922 -0.938988 -1.115373 -0.619303
25%   -0.858270 -0.110182 -0.723777 -0.320115
50%    0.413031  0.451716 -0.366052  0.059483
75%    0.837827  0.843561  0.050567  0.874408
max    1.756228  1.084116  0.195152  1.548024

In [11]:
# Ordenar datos en el eje horizontal (columnas)
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.619303  0.074791  0.690580 -1.164156
2013-01-02 -0.094943 -0.710002  1.084116  1.756228
2013-01-03  1.548024  0.195152  0.212852  0.059389
2013-01-04  1.094575 -1.115373  0.894554 -1.808922
2013-01-05  0.213908 -0.022103 -0.217860  0.766672
2013-01-06 -0.395172 -0.728369 -0.938988  0.861545

In [12]:
# Ordenar datos en el eje vertical (columna B)
df.sort_values(by='B')

                   A         B         C         D
2013-01-06  0.861545 -0.938988 -0.728369 -0.395172
2013-01-05  0.766672 -0.217860 -0.022103  0.213908
2013-01-03  0.059389  0.212852  0.195152  1.548024
2013-01-01 -1.164156  0.690580  0.074791 -0.619303
2013-01-04 -1.808922  0.894554 -1.115373  1.094575
2013-01-02  1.756228  1.084116 -0.710002 -0.094943

## Selección de datos

Selección de columnas.  
La selección incluye también el índice, si no se indica lo contrario.

In [13]:
df['A']

2013-01-01   -1.164156
2013-01-02    1.756228
2013-01-03    0.059389
2013-01-04   -1.808922
2013-01-05    0.766672
2013-01-06    0.861545
Freq: D, Name: A, dtype: float64

Para obtener solo los valores de una columna, se deben solicitar éstos

In [14]:
df['A'].values

array([-1.16415631,  1.75622773,  0.05938929, -1.80892236,  0.76667204,
        0.86154543])

In [15]:
df.A

2013-01-01   -1.164156
2013-01-02    1.756228
2013-01-03    0.059389
2013-01-04   -1.808922
2013-01-05    0.766672
2013-01-06    0.861545
Freq: D, Name: A, dtype: float64

Seleccion de filas (deben ser contigüas en la tabla)

In [16]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.164156  0.690580  0.074791 -0.619303
2013-01-02  1.756228  1.084116 -0.710002 -0.094943
2013-01-03  0.059389  0.212852  0.195152  1.548024

### Selection por Etiquetas

Se puede seleccionar una fila por medio de su indice

In [17]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.loc[dates[0]]

A   -1.164156
B    0.690580
C    0.074791
D   -0.619303
Name: 2013-01-01 00:00:00, dtype: float64

In [19]:
df.loc[:,['A','B']] # Los : significan 'todos los datos en este eje'. En este caso se selecciona 'todas las filas' y 2 columnas

                   A         B
2013-01-01 -1.164156  0.690580
2013-01-02  1.756228  1.084116
2013-01-03  0.059389  0.212852
2013-01-04 -1.808922  0.894554
2013-01-05  0.766672 -0.217860
2013-01-06  0.861545 -0.938988

In [20]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.756228  1.084116
2013-01-03  0.059389  0.212852
2013-01-04 -1.808922  0.894554

### Seleccion por Posicion

In [21]:
df.iloc[3]

A   -1.808922
B    0.894554
C   -1.115373
D    1.094575
Name: 2013-01-04 00:00:00, dtype: float64

In [22]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.808922  0.894554
2013-01-05  0.766672 -0.217860

In [23]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.756228  1.084116 -0.710002 -0.094943
2013-01-03  0.059389  0.212852  0.195152  1.548024

In [24]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.756228 -0.710002
2013-01-03  0.059389  0.195152
2013-01-05  0.766672 -0.022103

## Valores no definidos

Comprobamos cómo se puede trabajar para eliminar / obviar la inclusión de valores no definidos en los conjuntos de datos.

In [25]:
# Se genera un conjunto de datos que incluya no definidos. Por ejemplo incluyendo una nueva columna 'E'

df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C         D    E
2013-01-01 -1.164156  0.690580  0.074791 -0.619303  1.0
2013-01-02  1.756228  1.084116 -0.710002 -0.094943  1.0
2013-01-03  0.059389  0.212852  0.195152  1.548024  NaN
2013-01-04 -1.808922  0.894554 -1.115373  1.094575  NaN

Podemos realizar varias operaciones:
- Eliminar del conjunto los valores indefinidos
- Incluir un valor por defecto (con cuidado de no variar en exceso el conjunto de datos)

In [26]:
# Eliminación de elementos no definidos
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01 -1.164156  0.690580  0.074791 -0.619303  1.0
2013-01-02  1.756228  1.084116 -0.710002 -0.094943  1.0

In [27]:
# Relleno de elementos
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01 -1.164156  0.690580  0.074791 -0.619303  1.0
2013-01-02  1.756228  1.084116 -0.710002 -0.094943  1.0
2013-01-03  0.059389  0.212852  0.195152  1.548024  5.0
2013-01-04 -1.808922  0.894554 -1.115373  1.094575  5.0

In [28]:
# Relleno de la columna 'E' con la media de los valores de esa columna
df1.fillna(value = df1['E'].mean())

                   A         B         C         D    E
2013-01-01 -1.164156  0.690580  0.074791 -0.619303  1.0
2013-01-02  1.756228  1.084116 -0.710002 -0.094943  1.0
2013-01-03  0.059389  0.212852  0.195152  1.548024  1.0
2013-01-04 -1.808922  0.894554 -1.115373  1.094575  1.0

## Operaciones

### Agrupaciones

In [29]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.449848 -0.506281
1  bar    one -1.628905  0.043431
2  foo    two  0.717007 -1.450891
3  bar  three -1.042415 -0.350158
4  foo    two -1.387774  0.096411
5  bar    two  1.464720  0.637322
6  foo    one  0.183730  1.288061
7  foo  three -0.372760 -0.408051

In [30]:
df.groupby('A').count()

     B  C  D
A
bar  3  3  3
foo  5  5  5

In [31]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -1.628905  0.043431
    three -1.042415 -0.350158
    two    1.464720  0.637322
foo one   -0.266118  0.781779
    three -0.372760 -0.408051
    two   -0.670767 -1.354481

### Aplicar Funciones

Se pueden definir al vuelo funciones lambda (anónimas) que se aplican a todas (o un subconjunto) de las columnas de la tabla.   
Resultan muy útiles para obtener campos calculados a partir de los datos originales.

In [32]:
#Ej: Se calula la diferencia entre el mayor y el menor valor de cada columna
df1.apply(lambda x: x.max() - x.min())

A    3.565150
B    0.871264
C    1.310525
D    2.167327
E    0.000000
dtype: float64

### Mezclas

#### Concatenación (horizontal)

In [33]:
# Se genera un conjunto de datos aleatorio (grande)
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.640357  0.150207  0.785060  1.187271
1 -0.522299  0.657273  1.902210 -1.012180
2  1.696184 -0.307514 -0.764651 -0.750342
3  0.069484  0.917404 -1.194906  1.964568
4 -0.484283  0.664582 -2.349547  0.507396
5 -0.913620 -2.219054 -1.708696 -1.222772
6  1.564124  0.849046  1.031720  1.851642
7 -0.607281 -0.383629 -0.525918  1.296901
8 -1.168905 -0.480140  0.491893 -0.976066
9  0.234934  0.523870 -0.361889 -0.032462

In [34]:
# Se reparte en varios trozos
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.640357  0.150207  0.785060  1.187271
 1 -0.522299  0.657273  1.902210 -1.012180
 2  1.696184 -0.307514 -0.764651 -0.750342,
           0         1         2         3
 3  0.069484  0.917404 -1.194906  1.964568
 4 -0.484283  0.664582 -2.349547  0.507396
 5 -0.913620 -2.219054 -1.708696 -1.222772
 6  1.564124  0.849046  1.031720  1.851642,
           0         1         2         3
 7 -0.607281 -0.383629 -0.525918  1.296901
 8 -1.168905 -0.480140  0.491893 -0.976066
 9  0.234934  0.523870 -0.361889 -0.032462]

In [35]:
# Se constuye otro DataFrame que contiene las piezas concatenadas
df2 = pd.concat(pieces)
df2

          0         1         2         3
0 -0.640357  0.150207  0.785060  1.187271
1 -0.522299  0.657273  1.902210 -1.012180
2  1.696184 -0.307514 -0.764651 -0.750342
3  0.069484  0.917404 -1.194906  1.964568
4 -0.484283  0.664582 -2.349547  0.507396
5 -0.913620 -2.219054 -1.708696 -1.222772
6  1.564124  0.849046  1.031720  1.851642
7 -0.607281 -0.383629 -0.525918  1.296901
8 -1.168905 -0.480140  0.491893 -0.976066
9  0.234934  0.523870 -0.361889 -0.032462

In [36]:
# Se puede comprobar que son iguales
df == df2

      0     1     2     3
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True
4  True  True  True  True
5  True  True  True  True
6  True  True  True  True
7  True  True  True  True
8  True  True  True  True
9  True  True  True  True

### Join (vertical)

In [37]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [38]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [39]:
# Se mezcla empleando como clave la columna ('key')
# Se generan todos los emparejamientos de los elementos 2 a 2 (al repetirse el valor de 'key')
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Otro ejemplo:

In [40]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [41]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [42]:
 pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

## Entrada / Salida en ficheros

### Lectura de datos

In [43]:
df = pd.read_csv('../data/FIFA18_Sample25.csv', index_col=0)
#df = df.drop('Unnamed: 0',axis=1) # Se elimina la 1ª columna, que no incluye información relevante (es el propio indice)
df.head(5)

,Unnamed: 0.1,Name,Age,Photo,Nationality,Flag,Overall,Potential,Club,Club Logo,...,RB,RCB,RCM,RDM,RF,RM,RS,RW,RWB,ST
17020,17020,J. Capacho,19,https://cdn.sofifa.org/48/18/players/239658.png,Colombia,https://cdn.sofifa.org/flags/56.png,54,67,Atlético Bucaramanga,https://cdn.sofifa.org/24/18/teams/112992.png,...,34.0,30.0,43.0,32.0,52.0,49.0,53.0,51.0,35.0,53.0
5979,5979,T. Makino,30,https://cdn.sofifa.org/48/18/players/194361.png,Japan,https://cdn.sofifa.org/flags/163.png,69,69,Urawa Red Diamonds,https://cdn.sofifa.org/24/18/teams/111575.png,...,66.0,68.0,62.0,67.0,57.0,61.0,56.0,58.0,66.0,56.0
10520,10520,A. Vincent,23,https://cdn.sofifa.org/48/18/players/227492.png,France,https://cdn.sofifa.org/flags/18.png,65,73,AJ Auxerre,https://cdn.sofifa.org/24/18/teams/57.png,...,43.0,35.0,58.0,42.0,65.0,64.0,64.0,65.0,46.0,64.0
6231,6231,Paulo Daineiro,33,https://cdn.sofifa.org/48/18/players/236165.png,Brazil,https://cdn.sofifa.org/flags/54.png,69,69,Associação Chapecoense de Futebol,https://cdn.sofifa.org/24/18/teams/112476.png,...,52.0,42.0,62.0,49.0,68.0,70.0,63.0,70.0,55.0,63.0
3096,3096,Alex Berenguer,21,https://cdn.sofifa.org/48/18/players/225201.png,Spain,https://cdn.sofifa.org/flags/45.png,73,81,Torino,https://cdn.sofifa.org/24/18/teams/54.png,...,71.0,65.0,68.0,68.0,71.0,73.0,68.0,72.0,72.0,68.0

### Escritura de datos

In [44]:
df2 = df.iloc[0:5,[0,1,3,5]]
df2

,Unnamed: 0.1,Name,Photo,Flag
17020,17020,J. Capacho,https://cdn.sofifa.org/48/18/players/239658.png,https://cdn.sofifa.org/flags/56.png
5979,5979,T. Makino,https://cdn.sofifa.org/48/18/players/194361.png,https://cdn.sofifa.org/flags/163.png
10520,10520,A. Vincent,https://cdn.sofifa.org/48/18/players/227492.png,https://cdn.sofifa.org/flags/18.png
6231,6231,Paulo Daineiro,https://cdn.sofifa.org/48/18/players/236165.png,https://cdn.sofifa.org/flags/54.png
3096,3096,Alex Berenguer,https://cdn.sofifa.org/48/18/players/225201.png,https://cdn.sofifa.org/flags/45.png

In [45]:
df2.to_csv('./First5.csv') # Se puede comprobar que se genera un fichero en formato csv con los datos de df2